public class Debug1 {
    static final int ONE = 5;
    public static void main (String[] args) { 
        int x, y, w, z;
        z = 9;
        if (z > 10){ //conditionsต้องอยู่ในวงเล็บและมี{}ที่กำหนดขอบเขตของเงื่อนไข if(){}จะมีวงเล็บและปีกกาด้วยเสมอตามsyntax
        x = 12;  //ควรเว้นบรรทัดให้จบทำงาน1คำสั่งให้ถูกต้องหรือหลัง;เพื่อง่ายต่อการแก้ไขปัญหา
        y = 5; // เปลี่ยนจากเครื่องหมาย,เป็น;เพราะเป็นการสิ้นสุดคำสั่ง และเพื่อให้โปรแกรมรู้ว่าควรเริ่มต้นคำสั่งใหม่ตรงไหน
        w = x + y + ONE;  //เปลี่ยนจากตัวเล็กoneเป้นONEเพราะค่าของตัวแปรตัวเล็กตัวใหญ่ไม่เหมือนกัน 
        }else
        x = 12; 
        y = 4; 
        w = x + y + ONE;
        System.out.println("w = "+ w);
    }
}